Before merge, verify that all the following plans are correct. They will be applied as-is after the merge.

#### Terraform plans
<details><summary>ipfs</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.this["js-kubo-rpc-client:master"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "master"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false
    }

  # github_branch_protection.this["js-kubo-rpc-client:release"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "release"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false
    }

  # github_branch_protection.this["js-kubo-rpc-client:release-*"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "release-*"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false
    }

  # github_repository.this["js-kubo-rpc-client"] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge       = false
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + branches               = (known after apply)
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = "A client library for the Kubo RPC API"
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "js-kubo-rpc-client"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "http-client",
          + "ipfs",
          + "kubo",
          + "rpc-client",
        ]
      + visibility             = "public"
    }

  # github_repository_collaborator.this["js-kubo-rpc-client:web3-bot"] will be created
  + resource "github_repository_collaborator" "this" {
      + id                          = (known after apply)
      + invitation_id               = (known after apply)
      + permission                  = "push"
      + permission_diff_suppression = false
      + repository                  = "js-kubo-rpc-client"
      + username                    = "web3-bot"
    }

  # github_team_repository.this["Maintainers:js-kubo-rpc-client"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "js-kubo-rpc-client"
      + team_id    = "3729031"
    }

  # github_team_repository.this["Merge - Go:js-kubo-rpc-client"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "js-kubo-rpc-client"
      + team_id    = "3364102"
    }

  # github_team_repository.this["Repos - Go:js-kubo-rpc-client"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "js-kubo-rpc-client"
      + team_id    = "3232508"
    }

  # github_team_repository.this["admin:js-kubo-rpc-client"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "js-kubo-rpc-client"
      + team_id    = "1516991"
    }

  # github_team_repository.this["contributors:js-kubo-rpc-client"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "pull"
      + repository = "js-kubo-rpc-client"
      + team_id    = "1376970"
    }

  # github_team_repository.this["ipdx:js-kubo-rpc-client"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "js-kubo-rpc-client"
      + team_id    = "6349983"
    }

  # github_team_repository.this["w3dt-stewards:js-kubo-rpc-client"] will be created
  + resource "github_team_repository" "this" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "js-kubo-rpc-client"
      + team_id    = "4656983"
    }

Plan: 12 to add, 0 to change, 0 to destroy.
```

</details>
<!-- Sticky Pull Request Comment -->